app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all

SELECT "logs".* FROM "logs"
---
  def show
    @logs = Log.all